index.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2024-11-13 Wed 11:30 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Orthogonalizing Variables in a Regression</title>
<meta name="author" content="Matt Brigida" />
<meta name="generator" content="Org Mode" />

</head>
<body>
<div id="content" class="content">
<h1 class="title">Orthogonalizing Variables in a Regression</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org0bda060">1. Motivation</a></li>
<li><a href="#org16fa097">2. Example in R</a></li>
</ul>
</div>
</div>

<div id="outline-container-org0bda060" class="outline-2">
<h2 id="org0bda060"><span class="section-number-2">1.</span> Motivation</h2>
<div class="outline-text-2" id="text-1">
<p>
Say we want to include two correlated variables as explanatory variables in a regression.  Doing this causes <code>multicollinearity</code>, which does not bias coefficients however does increase coefficient standard errors. Note, you can for excessive multicollinearity with variance inflation factors.  To remove the correlation between the variables we can use a process refered to as <i>orthogonalization</i> in the finance literature.  We describe this process in the example below.
</p>
</div>
</div>

<div id="outline-container-org16fa097" class="outline-2">
<h2 id="org16fa097"><span class="section-number-2">2.</span> Example in R</h2>
<div class="outline-text-2" id="text-2">
<p>
I was going to do the example in python, however the <code>yfinance</code> package was broken and so I will use R.  R has the added benefit that running regressions and extracting residuals is much more straightforward than in the various python statistical libraries.
</p>

<p>
Say we want to test whether crude oil and natural gas prices affect stock market prices, however we are concerned that crude oil and natural gas returns might be too correlated.  We therefore want to extract the part of crude oil returns which are uncorrelated with natural gas returns.  We could also just estimate the regression and use variance inflation factors to see the effect of multicollinearity, but we'll do this in another notebook.
</p>

<p>
We'll load the <code>quantmod</code> library to pull ETF prices:
</p>

<div class="org-src-container">
<pre class="src src-R"><span style="color: #268bd2; font-weight: bold;">library</span>(quantmod)
</pre>
</div>

<p>
Then pull daily ETF data for the stock market, crude oil, and natural gas:
</p>

<div class="org-src-container">
<pre class="src src-R">market <span style="color: #268bd2; font-weight: bold;">&lt;-</span> getSymbols(<span style="color: #2aa198;">"spy"</span>, auto.assign = <span style="color: #b58900;">FALSE</span>)
oil <span style="color: #268bd2; font-weight: bold;">&lt;-</span> getSymbols(<span style="color: #2aa198;">"uso"</span>, auto.assign = <span style="color: #b58900;">FALSE</span>)
ng <span style="color: #268bd2; font-weight: bold;">&lt;-</span> getSymbols(<span style="color: #2aa198;">"ung"</span>, auto.assign = <span style="color: #b58900;">FALSE</span>)
</pre>
</div>

<p>
Then convert the prices to returns and merge to get returns over a common time interval:
</p>

<div class="org-src-container">
<pre class="src src-R">data <span style="color: #268bd2; font-weight: bold;">&lt;-</span> merge.xts(Delt(Cl(oil)), Delt(Cl(ng)), Delt(Cl(market)), join=<span style="color: #2aa198;">"inner"</span>)[-1,]
names(data) <span style="color: #268bd2; font-weight: bold;">&lt;-</span> c(<span style="color: #2aa198;">"oil"</span>, <span style="color: #2aa198;">"ng"</span>, <span style="color: #2aa198;">"market"</span>)
</pre>
</div>

<p>
We can now estimate a correlation coefficient between daily crude oil and natural gas returns:
</p>

<div class="org-src-container">
<pre class="src src-R">cor(data$oil, data$ng)
</pre>
</div>

<pre class="example">
0.16688267808796
</pre>


<p>
Ok, that correlation is not too bad.  We could estimate the regression without orthogonalizing (checking variance inflation factors), however we'll continue.  The line of code below estimates the parameters of the following regression:
</p>

<p>
\[oil_t = \alpha + \beta ng_t + \epsilon_t\]
</p>

<p>
and extracts the estimated residuals \(\hat{\epsilon}_t\) into the variable names <code>oil_orthogonalized</code>.
</p>

<div class="org-src-container">
<pre class="src src-R">oil_orthogonalized <span style="color: #268bd2; font-weight: bold;">&lt;-</span> lm(data$oil ~ data$ng)$resid
</pre>
</div>

<p>
Now if we calculated the correlation between our orthogonalized crude oil and natural gas returns we find:
</p>

<div class="org-src-container">
<pre class="src src-R">cor(oil_orthogonalized, data$ng)
</pre>
</div>

<pre class="example">
4.1870964646196e-17
</pre>


<p>
Which is computer for 0.  Now there is no correlation between crude oil and natural gas, and we can run the following regression without worrying about the effect of multicollinearity.
</p>


<div class="org-src-container">
<pre class="src src-R">summary(lm(data$market ~ oil_orthogonalized + data$ng))
</pre>
</div>

<pre class="example" id="org1e37b20">
## Coefficients:
##                     Estimate Std. Error t value Pr(&gt;|t|)    
## (Intercept)        0.0004347  0.0001755   2.477   0.0133 *  
## oil_orthogonalized 0.1965857  0.0075897  25.902  &lt; 2e-16 ***
## data$ng            0.0409667  0.0058139   7.046 2.12e-12 ***
## ---
## Signif. codes:  0 ‘***’ 0.001 ‘**’ 0.01 ‘*’ 0.05 ‘.’ 0.1 ‘ ’ 1
## 
## Residual standard error: 0.01167 on 4420 degrees of freedom
## Multiple R-squared:  0.1402,	Adjusted R-squared:  0.1398 
## F-statistic: 360.3 on 2 and 4420 DF,  p-value: &lt; 2.2e-16
</pre>

<p>
The only downside is it is now a bit harder to interpret the coefficient on oil.  We <b>can't</b> say a 1% increase in oil is consistent with a 0.19% increase in the market&#x2014;we have to say a 1% increase in oil which is <b>uncorrelated with natural gas prices</b>.  So we don't have to worry about multicollinearity but we so have a harder time interpreting the regression.  Of course if oil is our main variables of interest, you would choose to orthogonalize natural gas with respect to oil, so we have no difficulty interpreting the coefficient on oil.  
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Matt Brigida</p>
<p class="date">Created: 2024-11-13 Wed 11:30</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
